# Creating a MySQL database

## Imports + Loading in data

In [1]:
#Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os,json
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
#Loading data
df = pd.read_csv('Data/title_basics.csv.gz')
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')

## Normalizing Genres

In [3]:
#creating a col with a list of genres
df['genres_split'] = df['genres'].str.split(',')
df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0094859,movie,Chief Zabu,Chief Zabu,0,2016,NaN,74,Comedy,[Comedy]

In [4]:
#exploding genres to separate the list of genres to new rows
exploded_genres = df.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama

In [5]:
#getting unique genres from the col
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Creating a new title_genres table

In [6]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

## Creating a genre mapper dictionary to replace string genres with integers

In [7]:
#making genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

##  Replacing the string genres in title_genres with the new integer ids.

In [8]:
# make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')

In [9]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

## Convert the genre map dictionary into a dataframe.

In [10]:
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(),
                            'Genre_id':genre_map.values()})
genre_lookup.head()

  Genre_Name  Genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Discarding unnecessary information

In [11]:
#Dropping unnecessary columns
df = df.drop(columns=['originalTitle','isAdult','titleType','genres','genres_split'])

## Saving the MySQL tables

### Creating a dataype schema for to_sql: title_basics

In [12]:
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = df['tconst'].fillna('').map(len).max()
title_len = df['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

### Creating a dataype schema for to_sql: title_genres

In [13]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 153682 entries, 0 to 82249
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    153682 non-null  object
 1   genre_id  153682 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [14]:
#For title_genres

## Calculate max string lengths for object columns
key_len2 = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_genres_schema = {
    "tconst": String(key_len+1), 
    "genre_id": Integer()}

### Creating a dataype schema for to_sql: title_genres

In [15]:
#For genres

## Calculate max string lengths for object columns
genre_len = genre_lookup['Genre_Name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
genres_schema = {
    "Genre_Name": String(genre_len+1), 
    "genre_id": Integer()}

### Creating a dataype schema for to_sql: title_ratings

In [16]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1905
1  tt0000002            5.8       256
2  tt0000003            6.5      1705
3  tt0000004            5.6       168
4  tt0000005            6.2      2519

In [17]:
title_ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1256534 entries, 0 to 1256533
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1256534 non-null  object
 1   averageRating  1256534 non-null  float64
 2   numVotes       1256534 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.8+ MB

In [18]:
#For title_ratings

## Calculate max string lengths for object columns
key_len3 = title_ratings['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
title_ratings_schema = {
    "tconst": String(key_len+1), 
    "averageRating  ": Float(),
    "numVotes": Integer()}

### Creating a dataype schema for to_sql: tmdb_data

In [19]:
tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.108,1956.0,PG
1,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.400,42.0,R
2,tt0120630,0.0,/sPAwM8WxMdXNlqeP4F9DMe9LYoY.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.726,4106.0,G
3,tt0120753,0.0,NaN,NaN,8000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,318.0,en,The Million Dollar Hotel,...,105983.0,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone has something to hide.,The Million Dollar Hotel,0.0,5.915,254.0,R
4,tt0120755,0.0,/24DZfupDlhXeTchmcOkoGRhP5Vg.jpg,"{'id': 87359, 'name': 'Mission: Impossible Col...",125000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,955.0,en,Mission: Impossible II,...,546388105.0,123.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Expect the impossible again.,Mission: Impossible II,0.0,6.108,5448.0,PG-13

In [20]:
#Only keeping imdb_id, revenue, budget, and certification
tmdb_df = tmdb_data[['imdb_id','revenue','budget','certification']]
tmdb_df.head()

     imdb_id      revenue       budget certification
0  tt0118694   12854953.0     150000.0            PG
1  tt0120467      14904.0     120000.0             R
2  tt0120630  224834564.0   45000000.0             G
3  tt0120753     105983.0    8000000.0             R
4  tt0120755  546388105.0  125000000.0         PG-13

In [21]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5168 entries, 0 to 5167
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        5168 non-null   object
 1   revenue        5168 non-null   float64
 2   budget         5168 non-null   float64
 3   certification  3968 non-null   object
dtypes: float64(2), object(2)
memory usage: 161.6+ KB

In [22]:
#For tmdb_data

## Calculate max string lengths for object columns
key_len4 = tmdb_df['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
tmdb_df_schema = {
    "imdb_id": String(key_len+1), 
    "certification  ": String(key_len+1),
    "revenue": Float(),
    "budget": Float()}

## Saving them all to sql

In [23]:
connection_str = "mysql+pymysql://root:root@localhost/movies"

## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [24]:
#Create engine
engine = create_engine(connection_str)

In [25]:
# Save to sql with dtype and index=False
df.to_sql('title_basics',engine,
          dtype=title_basics_schema,if_exists='replace',index=False)

title_ratings.to_sql('title_ratings',engine,
          dtype=title_ratings_schema,if_exists='replace',index=False)

title_genres.to_sql('title_genres',engine,
          dtype=title_genres_schema,if_exists='replace',index=False)

genre_lookup.to_sql('genres',engine,
          dtype=genres_schema,if_exists='replace',index=False)

tmdb_df.to_sql('tmdb_data',engine,
          dtype=tmdb_df_schema,if_exists='replace',index=False)

5168

In [26]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')